[
    {
        "_id": 1,
        "topic": "Web Development",
        "userName": "ReactJS",
        "title": "React.js is a component based front end library that makes it very easy to build Single Page Applications or SPAs",
        "time": "2h",
        "image": "react-logo.png",
        "liked": true,
        "replies": 123,
        "retuits": 432,
        "likes": 2345,
        "handle": "@reactjs",
        "tuit": "Today, front-end frameworks and libraries are becoming an essential part of the modern web development stack. React.js is a front-end library that has gradually become the go-to framework for modern web development within the JavaScript community."
    },
    {
        "_id": 2,
        "topic": "JavaScript",
        "userName": "JavaScript",
        "title": "JavaScript is a programming language that can run on browsers as well as desktops",
        "time": "2h",
        "image": "javascript-logo.png",
        "liked": true,
        "disliked": false,
        "replies": 123,
        "retuits": 456,
        "likes": 7890,
        "dislikes": 78,
        "handle": "@javascript",
        "tuit": "JavaScript is a scripting or programming language that allows you to implement complex features on web pages — every time a web page does more than just sit there and display static information for you to look at — displaying timely content updates, interactive maps, animated 2D/3D graphics, scrolling video jukeboxes, etc."
    },
    {
        "_id": 3,
        "topic": "Web Development",
        "userName": "jQuery",
        "title": "jQuery is a fast, small, and feature-rich JavaScript library",
        "time": "4d",
        "image": "jquery-logo.png",
        "liked": false,
        "disliked": false,
        "replies": 456,
        "retuits": 999,
        "likes": 12345,
        "dislikes": 123,
        "handle": "@jquery",
        "tuit": "jQuery is a fast, small, and feature-rich JavaScript library. It makes things like HTML document traversal and manipulation, event handling, animation, and Ajax much simpler with an easy-to-use API that works across a multitude of browsers. With a combination of versatility and extensibility, jQuery has changed the way that millions of people write JavaScript."
    },
    {
        "_id": 4,
        "topic": "Web Development",
        "userName": "NodeJS",
        "title": "Node.js is a cross-platform, open-source server environment that can run on Windows, Linux, Unix, macOS, and more",
        "time": "6d",
        "image": "nodejs-logo.png",
        "liked": false,
        "disliked": false,
        "replies": 1000,
        "retuits": 2000,
        "likes": 30000,
        "dislikes": 300,
        "handle": "@nodejs",
        "tuit": "As an asynchronous event-driven JavaScript runtime, Node.js is designed to build scalable network applications. In the following \"hello world\" example, many connections can be handled concurrently. Upon each connection, the callback is fired, but if there is no work to be done, Node.js will sleep."
    }
]